<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of MRIConvert and imports into munki.
    </string>
    <key>Identifier</key>
    <string>com.github.mpib.munki.mriconvert</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MRIConvert</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/mri</string>
        <key>MUNKI_CATEGORY</key>
        <string>MRI</string>
        <key>pkginfo</key>
            <dict>
                <key>catalog</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>MRIConvert now supports Enhanced MR image objects. Try MRIConvert for NIfTI output, Analyze 7.5 output, and automatic generation of diffusion gradient files for Siemens Syngo scanners, Philips, and some GE scanners.
                </string>
                <key>display_name</key>
                <string>MRIConvert</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>developer</key>
                <string>Lewis Center for Neuroimaging</string>
            </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mpib.download.mriconvert</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/MRIConvert.dmg/MRIConvert.app</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/MRIConvert.app</string>
                <key>overwrite</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/MRIConvert.app</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/MRIConvert.dmg</string>
            </dict>
            <key>Processor</key>
            <string>DmgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/MRIConvert.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
