<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of MRIConvert.
    </string>
    <key>Identifier</key>
    <string>com.github.mpib.download.mriconvert</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MRIConvert</string>
        <key>REL_URL</key>
        <string>https://lcni.uoregon.edu/downloads/mriconvert</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%REL_URL%</string>
                <key>re_pattern</key>
                <string>.*(MRIConvert.*\.dmg)&lt;</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%REL_URL%/%match%/at_download/file</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
